Bakisha/STM32SAM/src/STM32SAM.cpp
  43   |  **     | 01000000 |
  45   |  **     | 01000100 |
  46   |  **     | 00000000 |
  47   |  **     | 00000000 |


  55   |  **     | 01001110 |
  56   |  **     | 01001110 |
  58   |  **     | 01001110 |
  59   |  **     | 01001110 |
  61   |  **     | 01001110 |
  62   |  **     | 01001110 |
  63   |  GX     | 01001110 |
  64   |  **     | 01001110 |
  65   |  **     | 01001110 |
  67   |  **     | 01001011 |
  68   |  **     | 01001011 |
  70   |  **     | 01001011 |
  71   |  **     | 01001011 |
  73   |  **     | 01001011 |
  74   |  **     | 01001011 |
  75   |  KX     | 01001011 |
  76   |  **     | 01001011 |
  77   |  **     | 01001011 |


  SPECIAL
  78   |  UL     | 10000000 |
  79   |  UM     | 11000001 |
  80   |  UN     | 11000001 |
  31   |  Q*     | 01001100 |

*/


////////////////////////////////////////////////////////////////////////////////////////////
//
//           RenderTabs
//
////////////////////////////////////////////////////////////////////////////////////////////


const unsigned char tab48426[5] = { 0x18, 0x1A, 0x17, 0x17, 0x17 };

const unsigned char tab47492[] =
{
  0 , 0 , 0xE0 , 0xE6 , 0xEC , 0xF3 , 0xF9 , 0 ,
  6 , 0xC , 6
};


const unsigned char amplitudeRescale[] =
{
  0 , 1 , 2 , 2 , 2 , 3 , 3 , 4 ,
  4 , 5 , 6 , 8 , 9 , 0xB , 0xD , 0xF, 0 //17 elements?
};

// Used to decide which phoneme's blend lengths. The candidate with the lower score is selected.
// tab45856
const unsigned char blendRank[] =
{
  0 , 0x1F , 0x1F , 0x1F , 0x1F , 2 , 2 , 2 ,
  2 , 2 , 2 , 2 , 2 , 2 , 5 , 5 ,
  2 , 0xA , 2 , 8 , 5 , 5 , 0xB , 0xA ,
  9 , 8 , 8 , 0xA0 , 8 , 8 , 0x17 , 0x1F ,
  0x12 , 0x12 , 0x12 , 0x12 , 0x1E , 0x1E , 0x14 , 0x14 ,
  0x14 , 0x14 , 0x17 , 0x17 , 0x1A , 0x1A , 0x1D , 0x1D ,
  2 , 2 , 2 , 2 , 2 , 2 , 0x1A , 0x1D ,
  0x1B , 0x1A , 0x1D , 0x1B , 0x1A , 0x1D , 0x1B , 0x1A ,
  0x1D , 0x1B , 0x17 , 0x1D , 0x17 , 0x17 , 0x1D , 0x17 ,
  0x17 , 0x1D , 0x17 , 0x17 , 0x1D , 0x17 , 0x17 , 0x17
};


// Number of frames at the end of a phoneme devoted to interpolating to next phoneme's final value
//tab45696
const unsigned char outBlendLength[] =
{
  0 , 2 , 2 , 2 , 2 , 4 , 4 , 4 ,
  4 , 4 , 4 , 4 , 4 , 4 , 4 , 4 ,
  4 , 4 , 3 , 2 , 4 , 4 , 2 , 2 ,
  2 , 2 , 2 , 1 , 1 , 1 , 1 , 1 ,
  1 , 1 , 1 , 1 , 1 , 1 , 2 , 2 ,
  2 , 1 , 0 , 1 , 0 , 1 , 0 , 5 ,
  5 , 5 , 5 , 5 , 4 , 4 , 2 , 0 ,
  1 , 2 , 0 , 1 , 2 , 0 , 1 , 2 ,
  0 , 1 , 2 , 0 , 2 , 2 , 0 , 1 ,
  3 , 0 , 2 , 3 , 0 , 2 , 0xA0 , 0xA0
};


// Number of frames at beginning of a phoneme devoted to interpolating to phoneme's final value
// tab45776
const unsigned char inBlendLength[] =
{
  0 , 2 , 2 , 2 , 2 , 4 , 4 , 4 ,
  4 , 4 , 4 , 4 , 4 , 4 , 4 , 4 ,
  4 , 4 , 3 , 3 , 4 , 4 , 3 , 3 ,
  3 , 3 , 3 , 1 , 2 , 3 , 2 , 1 ,
  3 , 3 , 3 , 3 , 1 , 1 , 3 , 3 ,
  3 , 2 , 2 , 3 , 2 , 3 , 0 , 0 ,
  5 , 5 , 5 , 5 , 4 , 4 , 2 , 0 ,
  2 , 2 , 0 , 3 , 2 , 0 , 4 , 2 ,
  0 , 3 , 2 , 0 , 2 , 2 , 0 , 2 ,
  3 , 0 , 3 , 3 , 0 , 3 , 0xB0 , 0xA0
};


// Looks like it's used as bit flags
// High bits masked by 248 (11111000)
//
// 32: S*    241         11110001
// 33: SH    226         11100010
// 34: F*    211         11010011
// 35: TH    187         10111011
// 36: /H    124         01111100
// 37: /X    149         10010101
// 38: Z*    1           00000001
// 39: ZH    2           00000010
// 40: V*    3           00000011
// 41: DH    3           00000011
// 43: **    114         01110010
// 45: **    2           00000010
// 67: **    27          00011011
// 70: **    25          00011001
// tab45936
const unsigned char sampledConsonantFlags[] =
{
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0xF1 , 0xE2 , 0xD3 , 0xBB , 0x7C , 0x95 , 1 , 2 ,
  3 , 3 , 0 , 0x72 , 0 , 2 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0 , 0 , 0x1B , 0 , 0 , 0x19 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0 , 0
};


//tab45056
unsigned char freq1data[] =
{
  0x00 , 0x13 , 0x13 , 0x13 , 0x13 , 0xA , 0xE , 0x12
  ,  0x18 , 0x1A , 0x16 , 0x14 , 0x10 , 0x14 , 0xE , 0x12
  ,   0xE , 0x12 , 0x12 , 0x10 , 0xC , 0xE , 0xA , 0x12
  ,   0xE , 0xA  , 8  , 6  , 6  ,  6 ,  6 , 0x11
  ,    6 , 6 , 6 , 6 , 0xE , 0x10 , 9 , 0xA
  ,    8 , 0xA , 6 , 6 , 6 , 5 , 6 , 0
  ,  0x12 , 0x1A , 0x14 , 0x1A , 0x12 , 0xC , 6 , 6
  ,    6 , 6 , 6 , 6 , 6 , 6 , 6 , 6
  ,    6 , 6 , 6 , 6 , 6 , 6 , 6 , 6
  ,    6 , 0xA , 0xA , 6 , 6 , 6 , 0x2C , 0x13
};

//tab451356
unsigned char freq2data [] =
{
  0x00 , 0x43 , 0x43 , 0x43 , 0x43 , 0x54 , 0x48 , 0x42 ,
  0x3E , 0x28 , 0x2C , 0x1E , 0x24 , 0x2C , 0x48 , 0x30 ,
  0x24 , 0x1E , 0x32 , 0x24 , 0x1C , 0x44 , 0x18 , 0x32 ,
  0x1E , 0x18 , 0x52 , 0x2E , 0x36 , 0x56 , 0x36 , 0x43 ,
  0x49 , 0x4F , 0x1A , 0x42 , 0x49 , 0x25 , 0x33 , 0x42 ,
  0x28 , 0x2F , 0x4F , 0x4F , 0x42 , 0x4F , 0x6E , 0x00 ,
  0x48 , 0x26 , 0x1E , 0x2A , 0x1E , 0x22 , 0x1A , 0x1A ,
  0x1A , 0x42 , 0x42 , 0x42 , 0x6E , 0x6E , 0x6E , 0x54 ,
  0x54 , 0x54 , 0x1A , 0x1A , 0x1A , 0x42 , 0x42 , 0x42 ,
  0x6D , 0x56 , 0x6D , 0x54 , 0x54 , 0x54 , 0x7F , 0x7F
};
//tab45216
unsigned char  freq3data[] =
{
  0x00 , 0x5B , 0x5B , 0x5B , 0x5B , 0x6E , 0x5D , 0x5B ,
  0x58 , 0x59 , 0x57 , 0x58 , 0x52 , 0x59 , 0x5D , 0x3E ,
  0x52 , 0x58 , 0x3E , 0x6E , 0x50 , 0x5D , 0x5A , 0x3C ,
  0x6E , 0x5A , 0x6E , 0x51 , 0x79 , 0x65 , 0x79 , 0x5B ,
  0x63 , 0x6A , 0x51 , 0x79 , 0x5D , 0x52 , 0x5D , 0x67 ,
  0x4C , 0x5D , 0x65 , 0x65 , 0x79 , 0x65 , 0x79 , 0x00 ,
  0x5A , 0x58 , 0x58 , 0x58 , 0x58 , 0x52 , 0x51 , 0x51 ,
  0x51 , 0x79 , 0x79 , 0x79 , 0x70 , 0x6E , 0x6E , 0x5E ,
  0x5E , 0x5E , 0x51 , 0x51 , 0x51 , 0x79 , 0x79 , 0x79 ,
  0x65 , 0x65 , 0x70 , 0x5E , 0x5E , 0x5E , 0x08 , 0x01
};












////////////////////////////////////////////////////////////////////////////////////////////
//
//           Reciter
//
////////////////////////////////////////////////////////////////////////////////////////////

unsigned char inputtemp[256];   // secure copy of input tab36096



////////////////////////////////////////////////////////////////////////////////////////////
//
//           Render
//
////////////////////////////////////////////////////////////////////////////////////////////






//timetable for more accurate c64 simulation
int timetable[5][5] =
{
  {162, 167, 167, 127, 128},
  {226, 60, 60, 0, 0},
  {225, 60, 59, 0, 0},
  {200, 0, 0, 54, 55},
  {199, 0, 0, 54, 54}
};



unsigned oldtimetableindex ;








const unsigned char ampl1data[] =
{
  0 , 0 , 0 , 0 , 0 , 0xD , 0xD , 0xE ,
  0xF , 0xF , 0xF , 0xF , 0xF , 0xC , 0xD , 0xC ,
  0xF , 0xF , 0xD , 0xD , 0xD , 0xE , 0xD , 0xC ,
  0xD , 0xD , 0xD , 0xC , 9 , 9 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 0xB , 0xB ,
  0xB , 0xB , 0 , 0 , 1 , 0xB , 0 , 2 ,
  0xE , 0xF , 0xF , 0xF , 0xF , 0xD , 2 , 4 ,
  0 , 2 , 4 , 0 , 1 , 4 , 0 , 1 ,
  4 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0xC , 0 , 0 , 0 , 0 , 0xF , 0xF
};

const unsigned char ampl2data[] =
{
  0 , 0 , 0 , 0 , 0 , 0xA , 0xB , 0xD ,
  0xE , 0xD , 0xC , 0xC , 0xB , 9 , 0xB , 0xB ,
  0xC , 0xC , 0xC , 8 , 8 , 0xC , 8 , 0xA ,
  8 , 8 , 0xA , 3 , 9 , 6 , 0 , 0 ,
  0 , 0 , 0 , 0 , 0 , 0 , 3 , 5 ,
  3 , 4 , 0 , 0 , 0 , 5 , 0xA , 2 ,
  0xE , 0xD , 0xC , 0xD , 0xC , 8 , 0 , 1 ,
  0 , 0 , 1 , 0 , 0 , 1 , 0 , 0 ,
  1 , 0 , 0 , 0 , 0 , 0 , 0 , 0 ,
  0 , 0xA , 0 , 0 , 0xA , 0 , 0 , 0
};

