Bakisha/STM32SAM/src/STM32SAM.cpp
  ']', 'G' | 0x80,
  ' ', '(', 'G', ')', ' ',                    '=', 'J', 'I', 'Y', '4' | 0x80,
  '(', 'G', 'I', 'V', ')',                    '=', 'G', 'I', 'H', '5', 'V' | 0x80,
  ' ', '(', 'G', ')', 'I', '^',                '=', 'G' | 0x80,
  '(', 'G', 'E', ')', 'T',                    '=', 'G', 'E', 'H', '5' | 0x80,
  'S', 'U', '(', 'G', 'G', 'E', 'S', ')',        '=', 'G', 'J', 'E', 'H', '4', 'S' | 0x80,
  '(', 'G', 'G', ')',                        '=', 'G' | 0x80,
  ' ', 'B', '#', '(', 'G', ')',                '=', 'G' | 0x80,
  '(', 'G', ')', '+',                        '=', 'J' | 0x80,
  '(', 'G', 'R', 'E', 'A', 'T', ')',            '=', 'G', 'R', 'E', 'Y', '4', 'T' | 0x80,
  '(', 'G', 'O', 'N', ')', 'E',                '=', 'G', 'A', 'O', '5', 'N' | 0x80,
  '#', '(', 'G', 'H', ')', '=' | 0x80,
  ' ', '(', 'G', 'N', ')',                    '=', 'N' | 0x80,
  '(', 'G', ')',                            '=', 'G' | 0x80,

  ']', 'H' | 0x80,
  ' ', '(', 'H', ')', ' ',                    '=', 'E', 'Y', '4', 'C', 'H' | 0x80,
  ' ', '(', 'H', 'A', 'V', ')',                '=', '/', 'H', 'A', 'E', '6', 'V' | 0x80,
  ' ', '(', 'H', 'E', 'R', 'E', ')',            '=', '/', 'H', 'I', 'Y', 'R' | 0x80,
  ' ', '(', 'H', 'O', 'U', 'R', ')',            '=', 'A', 'W', '5', 'E', 'R' | 0x80,
  '(', 'H', 'O', 'W', ')',                    '=', '/', 'H', 'A', 'W' | 0x80,
  '(', 'H', ')', '#',                        '=', '/', 'H' | 0x80,
  '(', 'H', ')', '=' | 0x80,

  ']', 'I' | 0x80,
  ' ', '(', 'I', 'N', ')',                    '=', 'I', 'H', 'N' | 0x80,
  ' ', '(', 'I', ')', ' ',                    '=', 'A', 'Y', '4' | 0x80,
  '(', 'I', ')', ' ',                        '=', 'A', 'Y' | 0x80,
  '(', 'I', 'N', ')', 'D',                    '=', 'A', 'Y', '5', 'N' | 0x80,
  'S', 'E', 'M', '(', 'I', ')',                '=', 'I', 'Y' | 0x80,
  ' ', 'A', 'N', 'T', '(', 'I', ')',            '=', 'A', 'Y' | 0x80,
  '(', 'I', 'E', 'R', ')',                    '=', 'I', 'Y', 'E', 'R' | 0x80,
  '#', ':', 'R', '(', 'I', 'E', 'D', ')', ' ',    '=', 'I', 'Y', 'D' | 0x80,
  '(', 'I', 'E', 'D', ')', ' ',                '=', 'A', 'Y', '5', 'D' | 0x80,
  '(', 'I', 'E', 'N', ')',                    '=', 'I', 'Y', 'E', 'H', 'N' | 0x80,
  '(', 'I', 'E', ')', 'T',                    '=', 'A', 'Y', '4', 'E', 'H' | 0x80,
  '(', 'I', '\'', ')',                        '=', 'A', 'Y', '5' | 0x80,
  ' ', ':', '(', 'I', ')', '^', '%',            '=', 'A', 'Y', '5' | 0x80,
  ' ', ':', '(', 'I', 'E', ')', ' ',            '=', 'A', 'Y', '4' | 0x80,
  '(', 'I', ')', '%',                        '=', 'I', 'Y' | 0x80,
  '(', 'I', 'E', ')',                        '=', 'I', 'Y', '4' | 0x80,
  ' ', '(', 'I', 'D', 'E', 'A', ')',            '=', 'A', 'Y', 'D', 'I', 'Y', '5', 'A', 'H' | 0x80,
  '(', 'I', ')', '^', '+', ':', '#',            '=', 'I', 'H' | 0x80,
  '(', 'I', 'R', ')', '#',                    '=', 'A', 'Y', 'R' | 0x80,
  '(', 'I', 'Z', ')', '%',                    '=', 'A', 'Y', 'Z' | 0x80,
  '(', 'I', 'S', ')', '%',                    '=', 'A', 'Y', 'Z' | 0x80,
  'I', '^', '(', 'I', ')', '^', '#',            '=', 'I', 'H' | 0x80,
  '+', '^', '(', 'I', ')', '^', '+',            '=', 'A', 'Y' | 0x80,
  '#', ':', '^', '(', 'I', ')', '^', '+',        '=', 'I', 'H' | 0x80,
  '(', 'I', ')', '^', '+',                    '=', 'A', 'Y' | 0x80,
  '(', 'I', 'R', ')',                        '=', 'E', 'R' | 0x80,
  '(', 'I', 'G', 'H', ')',                    '=', 'A', 'Y', '4' | 0x80,
  '(', 'I', 'L', 'D', ')',                    '=', 'A', 'Y', '5', 'L', 'D' | 0x80,
  ' ', '(', 'I', 'G', 'N', ')',                '=', 'I', 'H', 'G', 'N' | 0x80,
  '(', 'I', 'G', 'N', ')', ' ',                '=', 'A', 'Y', '4', 'N' | 0x80,
  '(', 'I', 'G', 'N', ')', '^',                '=', 'A', 'Y', '4', 'N' | 0x80,
  '(', 'I', 'G', 'N', ')', '%',                '=', 'A', 'Y', '4', 'N' | 0x80,
  '(', 'I', 'C', 'R', 'O', ')',                '=', 'A', 'Y', '4', 'K', 'R', 'O', 'H' | 0x80,
  '(', 'I', 'Q', 'U', 'E', ')',                '=', 'I', 'Y', '4', 'K' | 0x80,
  '(', 'I', ')',                            '=', 'I', 'H' | 0x80,

  ']', 'J' | 0x80,
  ' ', '(', 'J', ')', ' ',                    '=', 'J', 'E', 'Y', '4' | 0x80,
  '(', 'J', ')',                            '=', 'J' | 0x80,

  ']', 'K' | 0x80,
  ' ', '(', 'K', ')', ' ',                    '=', 'K', 'E', 'Y', '4' | 0x80,
  ' ', '(', 'K', ')', 'N', '=' | 0x80,
  '(', 'K', ')',                            '=', 'K' | 0x80,

  ']', 'L' | 0x80,
  ' ', '(', 'L', ')', ' ',                    '=', 'E', 'H', '4', 'L' | 0x80,
  '(', 'L', 'O', ')', 'C', '#',                '=', 'L', 'O', 'W' | 0x80,
  'L', '(', 'L', ')', '=' | 0x80,
  '#', ':', '^', '(', 'L', ')', '%',            '=', 'U', 'L' | 0x80,
  '(', 'L', 'E', 'A', 'D', ')',                '=', 'L', 'I', 'Y', 'D' | 0x80,
  ' ', '(', 'L', 'A', 'U', 'G', 'H', ')',        '=', 'L', 'A', 'E', '4', 'F' | 0x80,
  '(', 'L', ')',                            '=', 'L' | 0x80,

  ']', 'M' | 0x80,
  ' ', '(', 'M', ')', ' ',                    '=', 'E', 'H', '4', 'M' | 0x80,
  ' ', '(', 'M', 'R', '.', ')', ' ',            '=', 'M', 'I', 'H', '4', 'S', 'T', 'E', 'R' | 0x80,
  ' ', '(', 'M', 'S', '.', ')',                '=', 'M', 'I', 'H', '5', 'Z' | 0x80,
  ' ', '(', 'M', 'R', 'S', '.', ')', ' ',        '=', 'M', 'I', 'H', '4', 'S', 'I', 'X', 'Z' | 0x80,
  '(', 'M', 'O', 'V', ')',                    '=', 'M', 'U', 'W', '4', 'V' | 0x80,
  '(', 'M', 'A', 'C', 'H', 'I', 'N', ')',        '=', 'M', 'A', 'H', 'S', 'H', 'I', 'Y', '5', 'N' | 0x80,
  'M', '(', 'M', ')', '=' | 0x80,
  '(', 'M', ')',                            '=', 'M' | 0x80,

  ']', 'N' | 0x80,
  ' ', '(', 'N', ')', ' ',                    '=', 'E', 'H', '4', 'N' | 0x80,
  'E', '(', 'N', 'G', ')', '+',                '=', 'N', 'J' | 0x80,
  '(', 'N', 'G', ')', 'R',                    '=', 'N', 'X', 'G' | 0x80,
  '(', 'N', 'G', ')', '#',                    '=', 'N', 'X', 'G' | 0x80,
  '(', 'N', 'G', 'L', ')', '%',                '=', 'N', 'X', 'G', 'U', 'L' | 0x80,
  '(', 'N', 'G', ')',                        '=', 'N', 'X' | 0x80,
  '(', 'N', 'K', ')',                        '=', 'N', 'X', 'K' | 0x80,
  ' ', '(', 'N', 'O', 'W', ')', ' ',            '=', 'N', 'A', 'W', '4' | 0x80,
  'N', '(', 'N', ')', '=' | 0x80,
  '(', 'N', 'O', 'N', ')', 'E',                '=', 'N', 'A', 'H', '4', 'N' | 0x80,
  '(', 'N', ')',                            '=', 'N' | 0x80,

