Bakisha/STM32SAM/src/STM32SAM.cpp
  ']', 'W' | 0x80,
  ' ', '(', 'W', ')', ' ',                    '=', 'D', 'A', 'H', '4', 'B', 'U', 'L', 'Y', 'U', 'W' | 0x80,
  ' ', '(', 'W', 'E', 'R', 'E', ')',            '=', 'W', 'E', 'R' | 0x80,
  '(', 'W', 'A', ')', 'S', 'H',                '=', 'W', 'A', 'A' | 0x80,
  '(', 'W', 'A', ')', 'S', 'T',                '=', 'W', 'E', 'Y' | 0x80,
  '(', 'W', 'A', ')', 'S',                    '=', 'W', 'A', 'H' | 0x80,
  '(', 'W', 'A', ')', 'T',                    '=', 'W', 'A', 'A' | 0x80,
  '(', 'W', 'H', 'E', 'R', 'E', ')',            '=', 'W', 'H', 'E', 'H', 'R' | 0x80,
  '(', 'W', 'H', 'A', 'T', ')',                '=', 'W', 'H', 'A', 'H', 'T' | 0x80,
  '(', 'W', 'H', 'O', 'L', ')',                '=', '/', 'H', 'O', 'W', 'L' | 0x80,
  '(', 'W', 'H', 'O', ')',                    '=', '/', 'H', 'U', 'W' | 0x80,
  '(', 'W', 'H', ')',                        '=', 'W', 'H' | 0x80,
  '(', 'W', 'A', 'R', ')', '#',                '=', 'W', 'E', 'H', 'R' | 0x80,
  '(', 'W', 'A', 'R', ')',                    '=', 'W', 'A', 'O', 'R' | 0x80,
  '(', 'W', 'O', 'R', ')', '^',                '=', 'W', 'E', 'R' | 0x80,
  '(', 'W', 'R', ')',                        '=', 'R' | 0x80,
  '(', 'W', 'O', 'M', ')', 'A',                '=', 'W', 'U', 'H', 'M' | 0x80,
  '(', 'W', 'O', 'M', ')', 'E',                '=', 'W', 'I', 'H', 'M' | 0x80,
  '(', 'W', 'E', 'A', ')', 'R',                '=', 'W', 'E', 'H' | 0x80,
  '(', 'W', 'A', 'N', 'T', ')',                '=', 'W', 'A', 'A', '5', 'N', 'T' | 0x80,
  'A', 'N', 'S', '(', 'W', 'E', 'R', ')',        '=', 'E', 'R' | 0x80,
  '(', 'W', ')',                            '=', 'W' | 0x80,

  ']', 'X' | 0x80,
  ' ', '(', 'X', ')', ' ',                    '=', 'E', 'H', '4', 'K', 'R' | 0x80,
  ' ', '(', 'X', ')',                        '=', 'Z' | 0x80,
  '(', 'X', ')',                            '=', 'K', 'S' | 0x80,

  ']', 'Y' | 0x80,
  ' ', '(', 'Y', ')', ' ',                    '=', 'W', 'A', 'Y', '4' | 0x80,
  '(', 'Y', 'O', 'U', 'N', 'G', ')',            '=', 'Y', 'A', 'H', 'N', 'X' | 0x80,
  ' ', '(', 'Y', 'O', 'U', 'R', ')',            '=', 'Y', 'O', 'H', 'R' | 0x80,
  ' ', '(', 'Y', 'O', 'U', ')',                '=', 'Y', 'U', 'W' | 0x80,
  ' ', '(', 'Y', 'E', 'S', ')',                '=', 'Y', 'E', 'H', 'S' | 0x80,
  ' ', '(', 'Y', ')',                        '=', 'Y' | 0x80,
  'F', '(', 'Y', ')',                        '=', 'A', 'Y' | 0x80,
  'P', 'S', '(', 'Y', 'C', 'H', ')',            '=', 'A', 'Y', 'K' | 0x80,
  '#', ':', '^', '(', 'Y', ')',                '=', 'I', 'Y' | 0x80,
  '#', ':', '^', '(', 'Y', ')', 'I',            '=', 'I', 'Y' | 0x80,
  ' ', ':', '(', 'Y', ')', ' ',                '=', 'A', 'Y' | 0x80,
  ' ', ':', '(', 'Y', ')', '#',                '=', 'A', 'Y' | 0x80,
  ' ', ':', '(', 'Y', ')', '^', '+', ':', '#',    '=', 'I', 'H' | 0x80,
  ' ', ':', '(', 'Y', ')', '^', '#',            '=', 'A', 'Y' | 0x80,
  '(', 'Y', ')',                            '=', 'I', 'H' | 0x80,

  ']', 'Z' | 0x80,
  ' ', '(', 'Z', ')', ' ',                    '=', 'Z', 'I', 'Y', '4' | 0x80,
  '(', 'Z', ')',                            '=', 'Z' | 0x80,
  'j' | 0x80
};

const unsigned char rules2[] =
{
  '(', 'A', ')',                            '=' | 0x80,
  '(', '!', ')',                            '=', '.' | 0x80,
  '(', '"', ')', ' ',                        '=', '-', 'A', 'H', '5', 'N', 'K', 'W', 'O', 'W', 'T', '-' | 0x80,
  '(', '"', ')',                            '=', 'K', 'W', 'O', 'W', '4', 'T', '-' | 0x80,
  '(', '#', ')',                            '=', ' ', 'N', 'A', 'H', '4', 'M', 'B', 'E', 'R' | 0x80,
  '(', '$', ')',                            '=', ' ', 'D', 'A', 'A', '4', 'L', 'E', 'R' | 0x80,
  '(', '%', ')',                            '=', ' ', 'P', 'E', 'R', 'S', 'E', 'H', '4', 'N', 'T' | 0x80,
  '(', '&', ')',                            '=', ' ', 'A', 'E', 'N', 'D' | 0x80,
  '(', '\'', ')',                           '=' | 0x80,
  '(', '*', ')',                            '=', ' ', 'A', 'E', '4', 'S', 'T', 'E', 'R', 'I', 'H', 'S', 'K' | 0x80,
  '(', '+', ')',                            '=', ' ', 'P', 'L', 'A', 'H', '4', 'S' | 0x80,
  '(', ',', ')',                            '=', ',' | 0x80,
  ' ', '(', '-', ')', ' ',                    '=', '-' | 0x80,
  '(', '-', ')',                            '=' | 0x80,
  '(', '.', ')',                            '=', ' ', 'P', 'O', 'Y', 'N', 'T' | 0x80,
  '(', '/', ')',                            '=', ' ', 'S', 'L', 'A', 'E', '4', 'S', 'H' | 0x80,
  '(', '0', ')',                            '=', ' ', 'Z', 'I', 'Y', '4', 'R', 'O', 'W' | 0x80,
  ' ', '(', '1', 'S', 'T', ')',                '=', 'F', 'E', 'R', '4', 'S', 'T' | 0x80,
  ' ', '(', '1', '0', 'T', 'H', ')',            '=', 'T', 'E', 'H', '4', 'N', 'T', 'H' | 0x80,
  '(', '1', ')',                            '=', ' ', 'W', 'A', 'H', '4', 'N' | 0x80,
  ' ', '(', '2', 'N', 'D', ')',                '=', 'S', 'E', 'H', '4', 'K', 'U', 'N', 'D' | 0x80,
  '(', '2', ')',                            '=', ' ', 'T', 'U', 'W', '4' | 0x80,
  ' ', '(', '3', 'R', 'D', ')',                '=', 'T', 'H', 'E', 'R', '4', 'D' | 0x80,
  '(', '3', ')',                            '=', ' ', 'T', 'H', 'R', 'I', 'Y', '4' | 0x80,
  '(', '4', ')',                            '=', ' ', 'F', 'O', 'H', '4', 'R' | 0x80,
  ' ', '(', '5', 'T', 'H', ')',                '=', 'F', 'I', 'H', '4', 'F', 'T', 'H' | 0x80,
  '(', '5', ')',                            '=', ' ', 'F', 'A', 'Y', '4', 'V' | 0x80,
  ' ', '(', '6', '4', ')', ' ',                '=', 'S', 'I', 'H', '4', 'K', 'S', 'T', 'I', 'Y', ' ', 'F', 'O', 'H', 'R' | 0x80,
  '(', '6', ')',                            '=', ' ', 'S', 'I', 'H', '4', 'K', 'S' | 0x80,
  '(', '7', ')',                            '=', ' ', 'S', 'E', 'H', '4', 'V', 'U', 'N' | 0x80,
  ' ', '(', '8', 'T', 'H', ')',                '=', 'E', 'Y', '4', 'T', 'H' | 0x80,
  '(', '8', ')',                            '=', ' ', 'E', 'Y', '4', 'T' | 0x80,
  '(', '9', ')',                            '=', ' ', 'N', 'A', 'Y', '4', 'N' | 0x80,
  '(', ':', ')',                            '=', '.' | 0x80,
  '(', ';', ')',                            '=', '.' | 0x80,
  '(', '<', ')',                            '=', ' ', 'L', 'E', 'H', '4', 'S', ' ', 'D', 'H', 'A', 'E', 'N' | 0x80,
  '(', '=', ')',                            '=', ' ', 'I', 'Y', '4', 'K', 'W', 'U', 'L', 'Z' | 0x80,
  '(', '>', ')',                            '=', ' ', 'G', 'R', 'E', 'Y', '4', 'T', 'E', 'R', ' ', 'D', 'H', 'A', 'E', 'N' | 0x80,
  '(', '?', ')',                            '=', '?' | 0x80,
  '(', '@', ')',                            '=', ' ', 'A', 'E', '6', 'T' | 0x80,
  '(', '^', ')',                            '=', ' ', 'K', 'A', 'E', '4', 'R', 'I', 'X', 'T' | 0x80,
  ']', 'A' | 0x80
};


