Bakisha/STM32SAM/src/STM32SAM.cpp
    // finished with a glottal pulse?
    if (mem44 == 0)
    {
pos48159:
      // fetch the next glottal pulse length
      A = pitches[Y];
      mem44 = A;
      A = A - (A >> 2);
      mem38 = A;

      // reset the formant wave generators to keep them in
      // sync with the glottal pulse
      phase1 = 0;
      phase2 = 0;
      phase3 = 0;
      continue;
    }

    // decrement the count
    mem38--;

    // is the count non-zero and the sampled flag is zero?
    if ((mem38 != 0) || (mem39 == 0))
    {
      // reset the phase of the formants to match the pulse
      phase1 += frequency1[Y];
      phase2 += frequency2[Y];
      phase3 += frequency3[Y];
      continue;
    }

    // voiced sampled phonemes interleave the sample with the
    // glottal pulse. The sample flag is non-zero, so render
    // the sample for the phoneme.
    RenderSample(&mem66);
    goto pos48159;
  } //while


  // The following code is never reached. It's left over from when
  // the voiced sample code was part of this loop, instead of part
  // of RenderSample();

  //pos48315:
  int tempA;
  phase1 = A ^ 255;
  Y = mem66;
  do
  {
    //pos48321:

    mem56 = 8;
    A = Read(mem47, Y);

    //pos48327:
    do
    {
      //48327: ASL A
      //48328: BCC 48337
      tempA = A;
      A = A << 1;
      if ((tempA & 128) != 0)
      {
        X = 26;
        // mem[54296] = X;
        bufferpos += 150;
        //
        //
        //        buffer[bufferpos / 50] = (X & 15) * 16;
        //
        //



      } else
      {
        //mem[54296] = 6;
        X = 6;
        bufferpos += 150;
        //
        //        buffer[bufferpos / 50] = (X & 15) * 16;
        //
        //

      }

      for (X = wait2; X > 0; X--); //wait
      mem56--;
    } while (mem56 != 0);

    Y++;
    phase1++;

  } while (phase1 != 0);
  //  if (phase1 != 0) goto pos48321;
  A = 1;
  mem44 = 1;
  mem66 = Y;
  Y = mem49;
  return;
}



// Create a rising or falling inflection 30 frames prior to
// index X. A rising inflection is used for questions, and
// a falling inflection is used for statements.

void STM32SAM::AddInflection(unsigned char mem48, unsigned char phase1)
{
  //pos48372:
  //  mem48 = 255;
  //pos48376:

  // store the location of the punctuation
  mem49 = X;
  A = X;
  int Atemp = A;

  // backup 30 frames
  A = A - 30;
  // if index is before buffer, point to start of buffer
  if (Atemp <= 30) A = 0;
  X = A;

  // FIXME: Explain this fix better, it's not obvious
  // ML : A =, fixes a problem with invalid pitch with '.'
  while ( (A = pitches[X]) == 127) X++;


pos48398:
  //48398: CLC
  //48399: ADC 48

  // add the inflection direction
  A += mem48;
  phase1 = A;

  // set the inflection
  pitches[X] = A;
pos48406:

  // increment the position
  X++;

  // exit if the punctuation has been reached
  if (X == mem49) return; //goto pos47615;
  if (pitches[X] == 255) goto pos48406;
  A = phase1;
  goto pos48398;
}



/*
    SAM's voice can be altered by changing the frequencies of the
    mouth formant (F1) and the throat formant (F2). Only the voiced
    phonemes (5-29 and 48-53) are altered.
*/
void STM32SAM::SetMouthThroat()
{
  unsigned char initialFrequency;
  unsigned char newFrequency = 0;
  //unsigned char mouth; //mem38880
  //unsigned char throat; //mem38881

  // mouth formants (F1) 5..29
  unsigned char mouthFormants5_29[30] = {
    0, 0, 0, 0, 0, 10,
    14, 19, 24, 27, 23, 21, 16, 20, 14, 18, 14, 18, 18,
    16, 13, 15, 11, 18, 14, 11, 9, 6, 6, 6
  };

  // throat formants (F2) 5..29
  unsigned char throatFormants5_29[30] = {
    255, 255,
    255, 255, 255, 84, 73, 67, 63, 40, 44, 31, 37, 45, 73, 49,
    36, 30, 51, 37, 29, 69, 24, 50, 30, 24, 83, 46, 54, 86
  };

  // there must be no zeros in this 2 tables
  // formant 1 frequencies (mouth) 48..53
  unsigned char mouthFormants48_53[6] = {19, 27, 21, 27, 18, 13};

  // formant 2 frequencies (throat) 48..53
  unsigned char throatFormants48_53[6] = {72, 39, 31, 43, 30, 34};

  unsigned char pos = 5; //mem39216
  //pos38942:
  // recalculate formant frequencies 5..29 for the mouth (F1) and throat (F2)
  while (pos != 30)
  {
    // recalculate mouth frequency
    initialFrequency = mouthFormants5_29[pos];
    if (initialFrequency != 0) newFrequency = trans(mouth, initialFrequency);
    freq1data[pos] = newFrequency;

    // recalculate throat frequency
    initialFrequency = throatFormants5_29[pos];
    if (initialFrequency != 0) newFrequency = trans(throat, initialFrequency);
    freq2data[pos] = newFrequency;
    pos++;
  }

  //pos39059:
  // recalculate formant frequencies 48..53
  pos = 48;
  Y = 0;
  while (pos != 54)
  {
    // recalculate F1 (mouth formant)
    initialFrequency = mouthFormants48_53[Y];
    newFrequency = trans(mouth, initialFrequency);
    freq1data[pos] = newFrequency;

    // recalculate F2 (throat formant)
    initialFrequency = throatFormants48_53[Y];
    newFrequency = trans(throat, initialFrequency);
    freq2data[pos] = newFrequency;
    Y++;
    pos++;
  }
}





//return = (mem39212*mem39213) >> 1
unsigned char STM32SAM::trans(unsigned char mem39212, unsigned char mem39213)
{
  //pos39008:
  unsigned char carry;
  int temp;
  unsigned char mem39214, mem39215;
  A = 0;
  mem39215 = 0;
  mem39214 = 0;
  X = 8;
  do
  {
    carry = mem39212 & 1;
    mem39212 = mem39212 >> 1;
    if (carry != 0)
    {
      /*
                  39018: LSR 39212
                  39021: BCC 39033
      */
      carry = 0;
      A = mem39215;
      temp = (int)A + (int)mem39213;
      A = A + mem39213;
      if (temp > 255) carry = 1;
      mem39215 = A;
    }
    temp = mem39215 & 1;
    mem39215 = (mem39215 >> 1) | (carry ? 128 : 0);
    carry = temp;
    //39033: ROR 39215
    X--;
  } while (X != 0);
  temp = mem39214 & 128;
  mem39214 = (mem39214 << 1) | (carry ? 1 : 0);
  carry = temp;
  temp = mem39215 & 128;
  mem39215 = (mem39215 << 1) | (carry ? 1 : 0);
  carry = temp;

  return mem39215;
}




////////////////////////////////////////////////////////////////////////////////////////////
//
//           Sam
//
////////////////////////////////////////////////////////////////////////////////////////////





//char input[]={"/HAALAOAO MAYN NAAMAEAE IHSTT SAEBAASTTIHAAN \x9b\x9b\0"};
//unsigned char input[]={"/HAALAOAO \x9b\0"};
//unsigned char input[]={"AA \x9b\0"};
//unsigned char input[] = {"GUH5DEHN TAEG\x9b\0"};

//unsigned char input[]={"AY5 AEM EY TAO4LXKIHNX KAX4MPYUX4TAH. GOW4 AH/HEH3D PAHNK.MEYK MAY8 DEY.\x9b\0"};
//unsigned char input[]={"/HEH3LOW2, /HAW AH YUX2 TUXDEY. AY /HOH3P YUX AH FIYLIHNX OW4 KEY.\x9b\0"};
//unsigned char input[]={"/HEY2, DHIHS IH3Z GREY2T. /HAH /HAH /HAH.AYL BIY5 BAEK.\x9b\0"};
//unsigned char input[]={"/HAH /HAH /HAH \x9b\0"};
//unsigned char input[]={"/HAH /HAH /HAH.\x9b\0"};
//unsigned char input[]={".TUW BIY5Y3,, OHR NAA3T - TUW BIY5IYIY., DHAE4T IHZ DHAH KWEH4SCHAHN.\x9b\0"};
//unsigned char input[]={"/HEY2, DHIHS \x9b\0"};

//unsigned char input[]={" IYIHEHAEAAAHAOOHUHUXERAXIX  \x9b\0"};
//unsigned char input[]={" RLWWYMNNXBDGJZZHVDH \x9b\0"};
//unsigned char input[]={" SSHFTHPTKCH/H \x9b\0"};

