Bakisha/STM32SAM/src/STM32SAM.cpp
//unsigned char input[]={" EYAYOYAWOWUW ULUMUNQ YXWXRXLX/XDX\x9b\0"};


void STM32SAM::SetInput(char *_input)
{
  int i, l;
  l = strlen(_input);
  if (l > 254) l = 254;
  for (i = 0; i < l; i++) {
    input[i] = _input[i];
  }
  input[l] = 0;
}





// 168=pitches
// 169=frequency1
// 170=frequency2
// 171=frequency3
// 172=amplitude1
// 173=amplitude2
// 174=amplitude3


void STM32SAM::Init()
{
  bufferpos = 0;
  int i;
  SetMouthThroat( );

  bufferpos = 0;
  // TODO, check for free the memory, 10 seconds of output should be more than enough
  //buffer = malloc(22050*10);


  // buffer = (char*) calloc(1, sizeof(char));



  /*
    freq2data = &mem[45136];
    freq1data = &mem[45056];
    freq3data = &mem[45216];
  */
  //pitches = &mem[43008];
  /*
    frequency1 = &mem[43264];
    frequency2 = &mem[43520];
    frequency3 = &mem[43776];
  */
  /*
    amplitude1 = &mem[44032];
    amplitude2 = &mem[44288];
    amplitude3 = &mem[44544];
  */
  //phoneme = &mem[39904];
  /*
    ampl1data = &mem[45296];
    ampl2data = &mem[45376];
    ampl3data = &mem[45456];
  */

  for (i = 0; i < 256; i++)
  {
    stress[i] = 0;
    phonemeLength[i] = 0;
  }

  for (i = 0; i < 60; i++)
  {
    phonemeIndexOutput[i] = 0;
    stressOutput[i] = 0;
    phonemeLengthOutput[i] = 0;
  }
  phonemeindex[255] = 255; //to prevent buffer overflow // ML : changed from 32 to 255 to stop freezing with long inputs

}



//int Code39771()
int STM32SAM::SAMMain()
{
  Init();
  phonemeindex[255] = 32; //to prevent buffer overflow

  if (!Parser1()) {
    return 0;
  }

  Parser2();
  CopyStress();
  SetPhonemeLength();
  AdjustLengths();
  Code41240();
  do
  {
    A = phonemeindex[X];
    if (A > 80)
    {
      phonemeindex[X] = 255;
      break; // error: delete all behind it
    }
    X++;
  } while (X != 0);

  //pos39848:
  InsertBreath();

  //mem[40158] = 255;


  PrepareOutput();

  return 1;
}



//void Code48547()
void STM32SAM::PrepareOutput()
{
  A = 0;
  X = 0;
  Y = 0;

  //pos48551:
  while (1)
  {
    A = phonemeindex[X];
    if (A == 255)
    {
      A = 255;
      phonemeIndexOutput[Y] = 255;
      Render();
      return;
    }
    if (A == 254)
    {
      X++;
      int temp = X;
      //mem[48546] = X;
      phonemeIndexOutput[Y] = 255;
      Render();
      //X = mem[48546];
      X = temp;
      Y = 0;
      continue;
    }

    if (A == 0)
    {
      X++;
      continue;
    }

    phonemeIndexOutput[Y] = A;
    phonemeLengthOutput[Y] = phonemeLength[X];
    stressOutput[Y] = stress[X];
    X++;
    Y++;
  }
}



//void Code41014()
void STM32SAM::Insert(unsigned char position/*var57*/, unsigned char mem60, unsigned char mem59, unsigned char mem58)
{
  int i;
  for (i = 253; i >= position; i--) // ML : always keep last safe-guarding 255
  {
    phonemeindex[i + 1] = phonemeindex[i];
    phonemeLength[i + 1] = phonemeLength[i];
    stress[i + 1] = stress[i];
  }

  phonemeindex[position] = mem60;
  phonemeLength[position] = mem59;
  stress[position] = mem58;
  return;
}



//void Code48431()
void STM32SAM::InsertBreath()
{
  unsigned char mem54;
  unsigned char mem55;
  unsigned char index; //variable Y
  mem54 = 255;
  X++;
  mem55 = 0;
  unsigned char mem66 = 0;
  while (1)
  {
    //pos48440:
    X = mem66;
    index = phonemeindex[X];
    if (index == 255) return;
    mem55 += phonemeLength[X];

    if (mem55 < 232)
    {
      if (index != 254) // ML : Prevents an index out of bounds problem
      {
        A = flags2[index] & 1;
        if (A != 0)
        {
          X++;
          mem55 = 0;
          Insert(X, 254, mem59, 0);
          mem66++;
          mem66++;
          continue;
        }
      }
      if (index == 0) mem54 = X;
      mem66++;
      continue;
    }
    X = mem54;
    phonemeindex[X] = 31;   // 'Q*' glottal stop
    phonemeLength[X] = 4;
    stress[X] = 0;
    X++;
    mem55 = 0;
    Insert(X, 254, mem59, 0);
    X++;
    mem66 = X;
  }

}

// Iterates through the phoneme buffer, copying the stress value from
// the following phoneme under the following circumstance:

//     1. The current phoneme is voiced, excluding plosives and fricatives
//     2. The following phoneme is voiced, excluding plosives and fricatives, and
//     3. The following phoneme is stressed
//
//  In those cases, the stress value+1 from the following phoneme is copied.
//
// For example, the word LOITER is represented as LOY5TER, with as stress
// of 5 on the diphtong OY. This routine will copy the stress value of 6 (5+1)
// to the L that precedes it.


//void Code41883()
void STM32SAM::CopyStress()
{
  // loop thought all the phonemes to be output
  unsigned char pos = 0; //mem66
  while (1)
  {
    // get the phomene
    Y = phonemeindex[pos];

    // exit at end of buffer
    if (Y == 255) return;

    // if CONSONANT_FLAG set, skip - only vowels get stress
    if ((flags[Y] & 64) == 0) {
      pos++;
      continue;
    }
    // get the next phoneme
    Y = phonemeindex[pos + 1];
    if (Y == 255) //prevent buffer overflow
    {
      pos++; continue;
    } else
      // if the following phoneme is a vowel, skip
      if ((flags[Y] & 128) == 0)  {
        pos++;
        continue;
      }

    // get the stress value at the next position
    Y = stress[pos + 1];

    // if next phoneme is not stressed, skip
    if (Y == 0)  {
      pos++;
      continue;
    }

    // if next phoneme is not a VOWEL OR ER, skip
    if ((Y & 128) != 0)  {
      pos++;
      continue;
    }

    // copy stress from prior phoneme to this one
    stress[pos] = Y + 1;

    // advance pointer
    pos++;
  }

}




// The input[] buffer contains a string of phonemes and stress markers along
// the lines of:
//
//     DHAX KAET IHZ AH5GLIY. <0x9B>
//
// The byte 0x9B marks the end of the buffer. Some phonemes are 2 bytes
// long, such as "DH" and "AX". Others are 1 byte long, such as "T" and "Z".
// There are also stress markers, such as "5" and ".".
//
// The first character of the phonemes are stored in the table signInputTable1[].
// The second character of the phonemes are stored in the table signInputTable2[].
// The stress characters are arranged in low to high stress order in stressInputTable[].
//
// The following process is used to parse the input[] buffer:
//
// Repeat until the <0x9B> character is reached:
//
//        First, a search is made for a 2 character match for phonemes that do not
//        end with the '*' (wildcard) character. On a match, the index of the phoneme
//        is added to phonemeIndex[] and the buffer position is advanced 2 bytes.
//
//        If this fails, a search is made for a 1 character match against all
//        phoneme names ending with a '*' (wildcard). If this succeeds, the
//        phoneme is added to phonemeIndex[] and the buffer position is advanced
//        1 byte.
//
//        If this fails, search for a 1 character match in the stressInputTable[].
//        If this succeeds, the stress value is placed in the last stress[] table
//        at the same index of the last added phoneme, and the buffer position is
//        advanced by 1 byte.
//
//        If this fails, return a 0.
//
// On success:
//
//    1. phonemeIndex[] will contain the index of all the phonemes.
//    2. The last index in phonemeIndex[] will be 255.
//    3. stress[] will contain the stress value for each phoneme

