Bakisha/STM32SAM/src/STM32SAM.cpp
  int i;

  phonetic = 0;
  singmode = 1;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}

void STM32SAM::sing ( char *argv ) {

  int i;

  phonetic = 0;
  singmode = 1;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}


////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sayPhonetic (sing off, phonetic on)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::sayPhonetic (const char *argv ) {

  int i;

  phonetic = 1;
  singmode = 0;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}

void STM32SAM::sayPhonetic ( char *argv ) {

  int i;

  phonetic = 1;
  singmode = 0;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM singPhonetic (sing on, phonetic on)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::singPhonetic (const char *argv ) {

  int i;

  phonetic = 1;
  singmode = 1;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}

void STM32SAM::singPhonetic ( char *argv ) {

  int i;

  phonetic = 1;
  singmode = 0;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}


////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM voice (pitch, speed, mouth, throat)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setVoice(unsigned char _pitch /* = 64 */, unsigned char _speed /* = 72 */ , unsigned char  _mouth /* = 128 */ , unsigned char _throat /* = 128 */) {

  pitch = _pitch;
  speed = _speed;
  mouth = _mouth;
  throat = _throat;

}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setPitch (pitch)
//
////////////////////////////////////////////////////////////////////////////////////////////


void STM32SAM::setPitch(unsigned char _pitch /* = 64 */) {

  pitch = _pitch;

}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setSpeed (speed)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setSpeed( unsigned char _speed /* = 72 */) {

  speed = _speed;

}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setMouth (mouth)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setMouth(unsigned char  _mouth /* = 128 */) {

  mouth = _mouth;

}


////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setThroat (throat)
//
////////////////////////////////////////////////////////////////////////////////////////////


void STM32SAM::setThroat( unsigned char _throat /* = 128 */) {

  throat = _throat;

}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           Hardware
//
////////////////////////////////////////////////////////////////////////////////////////////
// Hardware specifics, for easier porting to other microcontrollers

//
// Set PA8 pin as PWM, at 256 timer ticks overflow (8bit resolution)


void STM32SAM::begin(void) {

#ifdef  USE_ROGER_CORE

  pinMode (PA8, PWM); //   audio output pin

  Timer1.setPeriod(4); // Can't set at 256 ticks, only in uS. First nearest uS is 4 (Roger core is only for bluepill, that means 72*4=288 ticks, or 128*4=512 ticks when overclocked. It's ok, just overall volume will be lower, because maximum volume will be 256/288 or 256/512)

#endif

#ifdef USE_STM32duino_CORE
  pinMode(PA8, OUTPUT);

  PWM->pause();
  PWM->setMode(1, TIMER_OUTPUT_COMPARE_PWM1, PA8); // TIM1 CH1 (PA8)
  PWM->setPrescaleFactor(1);
  PWM->setOverflow( 256 , TICK_FORMAT); // 256 ticks overflow, no matter the CPU (timer) speed
  PWM->resume();


#endif







} // begin


inline void STM32SAM::SetAUDIO (unsigned char main_volume) {


#ifdef USE_ROGER_CORE
  Timer1.setCompare(TIMER_CH1, main_volume);
#endif

#ifdef USE_STM32duino_CORE
  PWM->setCaptureCompare(1, main_volume, TICK_COMPARE_FORMAT);
#endif

}
